schreibfaul1/ESP32-MiniWebRadio/src/settings.h
#pragma once
#include "Arduino.h"
#include "tft_structures.h"

// predifined displays
// #define SPI_DISPlAY 0              // ILI9341   SPI display 320x240, 2.8inch, XPT2046, ESP32-S3 or ESP32-P4
// #define SPI_DISPLAY 1              // ILI9488   SPI display 480x320, 3.5inch, XPT2046, ESP32-S3 or ESP32-P4
// #define SPI_DISPLAY 2              // ILI9488   SPI display 480x320, 4.0inch, XPT2046, ESP32-S3 or ESP32-P4
#define SPI_DISPLAY 4              // ST7796    SPI display 480x320, 3.5inch, FT6x63,  ESP32-S3 or ESP32-P4
// #define ESP32_8048S070             // Sunton    RGB display 800x480, 7inch,   ESP32-S3 N16R8
// #define ESP32_WZ8048C050           // Elecrow   RGB display 800x480, 5inch,   ESP32-S3 N4R8
// #define ESP32_DIS08070H            // Elecrow   RGB display 800x480, 7inch,   ESP32-S3 N4R8
// #define ESP32_S3_Touch_LCD7        // Waveshare RGB display 800x480, 7inch,   ESP32-S3 N8R8
// #define USER_DEFINED_DISPLAY       // Selfmade  ESP32-S3 or ESP32-P4 devBoard with SPI display


#define TFT_CONTROLLER       7        // (0)SPI-ILI9341[320x240], (3)SPI-ILI9486[480x320], (4)SPI-ILI9488[480x320], (5)SPI-ST7796[480x320], (7)RGB[800x480], (8)DSI-EK97001[1024x600], (9)DSI-JD9165[1024x600], (10)ST7701[480x800]
#define DISPLAY_INVERSION    0        // only SPI displays, (0) off (1) on
#define TFT_ROTATION         2        // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
#define TFT_FREQUENCY        40000000 // only SPI displays, 80000000, 40000000, 27000000, 20000000, 10000000
#define BRIGHTNESS_INVERSION 0        // (0) off (1) on
#define TP_CONTROLLER        7        // (0)XPT2046 2.8", (1)XPT2046 3.5", (2)XPT2046 4.0", (7)GT911, (8)FT6x63
#define TP_ROTATION          1        // (0) none, (1) 90°CW, (2) 180°CW, (3) 270°CW
#define TP_H_MIRROR          0        // (0) default, (1) mirror up <-> down
#define TP_V_MIRROR          0        // (0) default, (1) mirror left <-> right
#define I2S_COMM_FMT         0        // (0) MAX98357A PCM5102A CS4344, (1) LSBJ (Least Significant Bit Justified format) PT8211
#define SDMMC_FREQUENCY      80000000 // 80000000 or 40000000 Hz
#define FTP_USERNAME         "esp32"  // user name in FTP Client
#define FTP_PASSWORD         "esp32"  // pw in FTP Client
#define CONN_TIMEOUT         2500     // unencrypted connection timeout in ms (http://...)
#define CONN_TIMEOUT_SSL     3500     // encrypted connection timeout in ms (https://...)
#define WIFI_TX_POWER        5        // 2 ... 21 (dBm) Adjust the WiFi transmission power to optimise power consumption or increase range, default: 5
#define LIST_TIMER           5        // After this time (seconds), the display returns from the list view



// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌 YOUR OWN DISPLAY [320x240] OR [480x320] TOUCHPAD-CONTROLLER XPT2046 OR FT6x36   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————

#if USER_DEFINED_DISPLAY
    #if CONFIG_IDF_TARGET_ESP32S3
    // Digital I/O used
        #define TFT_CS             8
        #define TFT_DC             12
        #define TFT_BL             10 // at -1 the brightness menu is not displayed
        #define TP_IRQ             39
        #define TP_CS              15
        #define SD_MMC_D0          11
        #define SD_MMC_CLK         13
        #define SD_MMC_CMD         14
        #define IR_PIN             4  // IR Receiver (if available)
        #define TFT_MOSI           18 // TFT and TP (FSPI)
        #define TFT_MISO           2  // TFT and TP (FSPI)
        #define TFT_SCK            17 // TFT and TP (FSPI)
        #define I2S_DOUT           9
        #define I2S_BCLK           3
        #define I2S_LRC            1
        #define I2S_MCLK           0
        #define BT_EMITTER_RX      45 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      38 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    20 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 48 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            41 // I2C, dala line for capacitive touchpadand and light sensor (-1 if not available)
        #define I2C_SCL            42 // I2C, clock line for capacitive touchpadand and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif                            // CONFIG_IDF_TARGET_ESP32S3

    #if CONFIG_IDF_TARGET_ESP32P4
        #define TFT_CS             26
        #define TFT_DC             3
        #define TFT_BL             4 // at -1 the brightness menu is not displayed
        #define TP_IRQ             5
        #define TP_CS              2
        #define SD_MMC_D0          39
        #define SD_MMC_D1          40
        #define SD_MMC_D2          41
        #define SD_MMC_D3          42
        #define SD_MMC_CLK         43
        #define SD_MMC_CMD         44
        #define IR_PIN             32 // IR Receiver (if available)
        #define TFT_MOSI           20 // TFT and TP (FSPI)
        #define TFT_MISO           21 // TFT and TP (FSPI)
        #define TFT_SCK            22 // TFT and TP (FSPI)
        #define I2S_DOUT           23
        #define I2S_BCLK           24
        #define I2S_LRC            25
        #define I2S_MCLK           -1
        #define BT_EMITTER_RX      27 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      28 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    29 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 30 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            7  // I2C, dala line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            8  // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
        #define AMP_ENABLED        33 // onboard amplifier (-1 if not available)
    // free pins 46, 47, 48, 49, 50, 51, 52
    #endif // CONFIG_IDF_TARGET_ESP32P4
#endif     // USER_DEFINED_DISPLAY

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [320x240] OR [480x320] TOUCHPAD-CONTROLLER XPT2046 OR FT6x36   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#ifdef SPI_DISPLAY
        #undef TFT_CONTROLLER
        #undef TFT_ROTATION
        #undef TP_CONTROLLER
        #undef TP_ROTATION
        #undef DISPLAY_INVERSION
    #if(SPI_DISPLAY == 0)
        #define TFT_CONTROLLER 0
        #define TFT_ROTATION 0
        #define TP_CONTROLLER 1
        #define TP_ROTATION 0
        #define DISPLAY_INVERSION 0
    #endif
    #if(SPI_DISPLAY == 1)
        #define TFT_CONTROLLER 4 // ILI9488
        #define TFT_ROTATION 0
        #define TP_CONTROLLER 1 // 3.5"
        #define TP_ROTATION 2
        #define DISPLAY_INVERSION 0
    #endif
    #if(SPI_DISPLAY == 2)
        #define TFT_CONTROLLER 5 // ILI9488
        #define TFT_ROTATION 0
        #define TP_CONTROLLER 1 // 4.0"
        #define TP_ROTATION 2
        #define DISPLAY_INVERSION 0
    #endif
    #if(SPI_DISPLAY == 4)
        #define TFT_CONTROLLER 5 // ILI9488
        #define TFT_ROTATION 0
        #define TP_CONTROLLER 8 // FT6x63
        #define TP_ROTATION 1
        #define DISPLAY_INVERSION 1
    #endif
   #if CONFIG_IDF_TARGET_ESP32S3
    // Digital I/O used
        #define TFT_CS             8
        #define TFT_DC             12
        #define TFT_BL             10 // at -1 the brightness menu is not displayed
        #define TP_IRQ             39
        #define TP_CS              15
        #define SD_MMC_D0          11
        #define SD_MMC_CLK         13
        #define SD_MMC_CMD         14
        #define IR_PIN             4  // IR Receiver (if available)
        #define TFT_MOSI           18 // TFT and TP (FSPI)
        #define TFT_MISO           2  // TFT and TP (FSPI)
        #define TFT_SCK            17 // TFT and TP (FSPI)
        #define I2S_DOUT           9
        #define I2S_BCLK           3
        #define I2S_LRC            1
        #define I2S_MCLK           0
        #define BT_EMITTER_RX      45 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      38 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_MODE    20 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 48 // high impulse -> awake after POWER_OFF (-1 if not available)
        #define I2C_SDA            41 // I2C, dala line for capacitive touchpadand and light sensor (-1 if not available)
        #define I2C_SCL            42 // I2C, clock line for capacitive touchpadand and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif                            // CONFIG_IDF_TARGET_ESP32S3

